; CMainDlg
MAIN_DISK      = DISC
MAIN_USB       = USB
MAIN_USB_2	  = USB-2
MAIN_SDCARD    = SD
MAIN_RADIO     = วิทยุ
MAIN_NAV       = GPS
MAIN_BLUETOOTH = BT
MAIN_REAR_CAMERA	  = CCD
MAIN_SETTING   = ตั้งค่าระบบ
MAIN_GAME	  =  เกมส์
MAIN_IPOD   = IPOD
MAIN_TV   	   = TV
MAIN_AM			= AM
MAIN_PM     = PM
MAIN_MUSIC  =  ดนตรี
MAIN_VIDEO  =  วิดีโอ
MAIN_PHOTO  =  ภาพถ่าย
MAIN_AVIN1   = AUX
MAIN_AVIN2   = AVIN
MAIN_CLOCK   = นาฬิกา
MAIN_CALENDAR  = ปฏิทิน
MAIN_CALCULATOR = เครื่องคิดเลข
MAIN_LINKING	   = จับคู่
MAIN_BOXMAN     = Sokoban
MAIN_RUSSIAN    = เตอติส
MAIN_GOBANG     = โกะ
MAIN_CHCHESS    = หมากรุกจีน
MAIN_OTHELLO    = สีดำและสีขาวหมาก
MAIN_SNAKE      = เจ้างูน้อย
MAIN_QTELZONE   = หมายเลขโทรศัพท์ค้นหา
MAIN_ECAR       = Ecar ออนไลน์
MAIN_VDISK      = ดิสก์เสมือนจริง
MAIN_CARINFO    = รถยนต์ข้อมูล
MAIN_PHONELINK  = Phonelink
MAIN_DIMMER     = Dimmer
MAIN_HOME       = HOME

WEEK_MON = Mon
WEEK_TUE = Tue
WEEK_WED = Wed
WEEK_THU = Thu
WEEK_FRI = Fri
WEEK_SAT = Sat
WEEK_SUN = Sun

;CCarInfo
CARINFO_RETAILL      = RetailL
CARINFO_TEMPOUTSIDER = อุณหภูมิภายนอก
CARINFO_BATTVTG      = BattVtg
CARINFO_SEATBLET     = Seatblet
CARINFO_TRUNK        = Trunk
CARINFO_BRAKE        = เบรก
CARINFO_CLEANWATER   = CleanWater
CARINFO_ENGINESPEED  = EngineSpeed
CARINFO_VELOCITY     = ความเร็ว
CARINFO_MILEAGE      = การสะสมไมล์
CARINFO_DR_CLOSE     = ใกล้ประตูทั้งหมด
CARINFO_DR_FL        = FRT-LH เปิด
CARINFO_DR_FR        = FRT-RH เปิด
CARINFO_DR_RL        = RR-LH เปิด
CARINFO_DR_RR        = RR-RH เปิด
CARINFO_ON           = บน
CARINFO_OFF          = ปิด
CARINFO_NORMAL       = ปกติ
CARINFO_NOENOUGH     = ต่ำเกินไป
CARINFO_SEATBLET_ON  = บน
CARINFO_BRAKE_ON     = ไม่ใส่

;CRadioDlg
RADIO_FREQ_FM_UNIT = MHz
RADIO_FREQ_AM_UNIT = KHz
RADIO_FREQ_CHINA   	= ประเทศจีน
RADIO_FREQ_ASIA   	= Asia
RADIO_FREQ_RUSSIAN 	= ประเทศรัสเซีย
RADIO_FREQ_EUROPE  	= ยุโรป
RADIO_FREQ_AMERICA1 	= สหรัฐอเมริกา1
RADIO_FREQ_AMERICA2 	= สหรัฐอเมริกา2
RADIO_FREQ_JAPANESE   = ประเทศญี่ปุ่น
RADIO_FREQ_MIDDLE_EAST = ตะวันออกกลาง
RADIO_FREQ_AUSTRALIA = Australia
RADIO_RDS = RDS
RADIO_RBDS = RBDS

;CSettingDlg
SET_LANGUAGE  = ภาษา
SET_TIME  = วันที่และเวลา
SET_WALLPAPER  = วอลล์เปเปอร์
SET_NAVI  = การเดินเรือ
SET_VIDEO  = วิดีโอ
SET_EQ  = EQ
SET_BALANCE = สมดุล
SET_SWC = SWC
SET_FACTORY = ตั้งค่าจากโรงงาน
SET_UPDATE_LOGO = ปรับปรุงโลโก้
SET_CALIBRATE  = การสอบเทียบ
SET_BLUETOOTH  = บลูทูธ
SET_BT_AUTOCONNECT = เชื่อมต่ออัตโนมัติ
SET_BT_AUTOANSWER  = ตอบรับอัตโนมัติ
SET_BT_PINCODE     = รหัสพิน
SET_WIFI       = Wifi
SET_SAFETY     = ความปลอดภัย
SET_GENERAL    = ทั่วไป
SET_BEEP       = เสียงเตือน
SET_LIGHT_CHECK = การทดสอบแสงสว่าง
SET_RESET      = ตั้งใหม่
SET_ABOUT      = เกี่ยวกับ
SET_RADIO_AREA = พื้นที่วิทยุ
SET_REAR_CAMERA = กล้องด้านหลังกระจก
SET_PARKING     = ที่จอดรถ
SET_BRIGHTNESS	   = ความสว่าง
SET_CONTRAST	     = ตรงกันข้าม
SET_HUE		         = สี
SET_SATURATION     = ความอิ่มตัว
SET_BACKLIGHT	     = แสงไฟ
SET_BACKLIGHT_NORMAL	= ความสว่างในเวลากลางวัน
SET_BACKLIGHT_NIGHT	  = คืนความสว่าง
SET_RESET_VIDEO_PARAM = ตั้งใหม่
SET_COLORFUL_VIDEO_PARAM = มีสีสัน
SET_SOFT_VIDEO_PARAM = อ่อน
SET_UPDATE_SUCCESS    = ประสบความสำเร็จในการปรับปรุง
SET_UPDATE_FAIL	      = ปรับปรุงล้มเหลว
SET_COLORFUL_LIGHTS   = Colorful Lights
SET_LIGHTS_AUTO       = Auto
SET_LIGHTS_RED        = Red
SET_LIGHTS_YELLOW     = Yellow
SET_LIGHTS_GREEN      = Green
SET_LIGHTS_LIGHTBLUE  = Light blue
SET_LIGHTS_BLUE       = Blue
SET_LIGHTS_PURPLE     = Purple
SET_LIGHTS_WHITE      = White
;Screen saver
SET_SCREEN_SAVER = สกรีนเซฟเวอร์
SET_SCREEN_MODE = สกรีนเซฟเวอร์
SET_SCREEN_TIME = รอเวลา
SET_SCREEN_OFF  =  ปิด
SET_SCREEN_BLACKSCREEN  =  หน้าจอสีดำ 
SET_SCREEN_CLOCK  = นาฬิกา
SET_SCREEN_30S  = 30 ที่สอง
SET_SCREEN_1M  = 1 นาที
SET_SCREEN_3M  = 3 นาที
SET_SCREEN_5M  = 5 นาที

;EQ
SET_AUDIO_NONE      = ใกล้
SET_AUDIO_CUSTOM   = ประเพณี
SET_AUDIO_ROCK    = ร็อค
SET_AUDIO_POPULAR = ป๊อบ
SET_AUDIO_LIVE    = สดใส
SET_AUDIO_DANCE   = เต้นรำ
SET_AUDIO_CLASSIC = คลาสสิค
SET_AUDIO_SOFT    = มีขนนุ่ม
SET_AUDIO_SUBWOOFER     = ซับวูฟเฟอร์
SET_AUDIO_BALANCE_FR    = FAL:
SET_AUDIO_BALANCE_LR    = BAL:
SET_AUDIO_LOUDNESS   = เสียงดัง

;SWC
SET_SWC_SEEKUP      = ก่อน
SET_SWC_SEEKDOWN    = ถัดไป
SET_SWC_VOL_INC     = ปริมาณ+
SET_SWC_VOL_DEC     = ปริมาณ-
SET_SWC_POWER_OFF   = กำลังปิดเครื่อง
SET_SWC_MUTE        = ใบ้
SET_SWC_HANGIN      = ลม
SET_SWC_HANGUP      = Hangup
SET_SWC_MODE        = โหมด
SET_SWC_NAVI        = การเดินเรือ
SET_SWC_RADIO       = วิทยุ
SET_SWC_DVD         = DVD
SET_SWC_TIP         = กดปุ่มล้อก่อนแล้วกดปุ่มที่สอดคล้องกันบนหน้าจอ
SET_SWC_WARN        = ระบบการศึกษาที่ปุ่มนี้
SET_SWC_SAVE         = บันทึก
SET_SWC_RESET        = ตั้งใหม่

;Wallpaper
SET_WALLPAPER_SUCCESSFULL		= ตั้งวอลล์เปเปอร์ตกลง

; system information
SET_OS_VERSION = OS:
SET_APP_VERSION = APP:
SET_SYSTEM_ID = ID:
SET_BOOT_VERSION = BOOT:
SET_MCU_VERSION = MCU:
SET_DVD_VERSION = DVD:
SET_MANUFACTURE = การผลิต:

; MCU update
SET_MCU_UPDATE = MCU ปรับปรุง
SET_MCU_UPDATE_TIP = อย่าปิดเมื่อ MCU ปรับปรุงก็จะเริ่มต้นใหม่หลังจากปรับปรุงเสร็จแล้ว
SET_MCU_UPDATE_NO_FILE = แฟ้มการปรับปรุงไม่มี.
SET_MCU_UPDATE_FAIL = MCU ปรับปรุงล้มเหลว
SET_MCU_UPDATE_SUCCESS = ประสบความสำเร็จในการปรับปรุง MCU ก็จะรีบูต.

; Factory set
SET_FACTORY_FUNCTIONS   = ฟังก์ชั่น
SET_FACTORY_LANGUAGE    = ภาษา
SET_FACTORY_CANBUS      = ประเภท CANbus
SET_FACTORY_LANGUAGE_DEFAULT = Default language
SET_FACTORY_LANGUAGE_SUPPORT = Support language
SET_FACTORY_SAVE_OK     = บันทึกเรียบร้อยแล้ว
SET_FACTORY_SAVE_FAIL   = บันทึกล้มเหลว
SET_FACTORY_SAVE_SD_OK  = การส่งออกไปยังการ์ด SD ที่ประสบความสำเร็จ
SET_FACTORY_SAVE_SD_FAIL  = การส่งออกไปยังการ์ด SD ล้มเหลว
SET_FACTORY_LOAD_SD_OK  = โหลดจาก SD card ที่ประสบความสำเร็จ
SET_FACTORY_LOAD_SD_FAIL  =อัพโหลดล้มเหลวจาก SD card
SET_FACTORY_NO_CONFIG_FILE  = โหลดจาก SD card ล้มเหลวไฟล์ config ได้อยู่
SET_FACTORY_CAPTURE         = จับภาพหน้าจอ
SET_FACTORY_H264            = H.264 support

; canbus
CANBUS_TYPE_NONE          = ไม่สนับสนุน
CANBUS_TYPE_RAISE_DASAUTO = DasAuto
CANBUS_TYPE_RAISE_FOCUS   = Focus
CANBUS_TYPE_RAISE_HONDA   = Honda
CANBUS_TYPE_RAISE_PEUGEOT = Peugeot
CANBUS_TYPE_RAISE_CAMRY   = Camry
CANBUS_TYPE_RAISE_HYUNDAI = Hyundai

; CMsgBoxDlg
MESSAGE_YES    = ใช่
MESSAGE_NO    = ไม่ 
MESSAGE_OK    = ตกลง
MESSAGE_CANCEL = ยกเลิก
MESSAGE_CALIBRATION = คุณแน่ใจว่าจะเริ่มต้นการสอบเทียบ?
MESSAGE_RESET = คุณแน่ใจหรือว่าต้องการรีเซ็ตการตั้งค่าทั้งหมดหรือไม่?

; CSetGpsDlg
SET_GPS_GAIN     = การเดินเรือ
SET_GPS_GAIN_OFF = ปิดการใช้งานการเล่นสื่อเมื่อมีการนำ
SET_GPS_PATH     = ช่องทางGPS
SET_GPS_AUTORUN  = ทำงานอัตโนมัติ
SET_GPS_FIND_FILE = ค้นหา...
SET_GPS_FILE_NOT_FOUND = ไฟล์ EXE ไม่พบ

; CGpsViewerDlg
GPS_INFO   = ข้อมูลจีพีเอส
GPS_RESET   = ตั้งใหม่
GPS_RETURN   = กลับ
GPS_LONGITUDE = ลองติจูด:
GPS_LATITUDE  = ละติจูด:
GPS_ALTITUDE  = ระดับความสูง:
GPS_SPEED     = ความเร็ว:
GPS_UTC       = UTC:

; CSetDateTimeDlg
SET_HOURTIME      = 24 ชั่วโมงเวลา
SET_AUTOSET_TIME  = ตั้งโดยอัตโนมัติ
SET_TIMEZONE      = โซนเวลา
SET_DST           = Daylight Savings

; CMusicDlg
MUSIC_UNKNOWN_ALBUM         = ไม่ทราบอัลบั้ม
MUSIC_UNKNOWN_TITLE         = ไม่ระบุชื่อ
MUSIC_UNKNOWN_ARTIST        = ศิลปินที่ไม่รู้จัก
MUSIC_NO_LYRIC              = ไม่มีเนื้อเพลง

; BT
BT_STATUS_UNCONNECT					= ปลด
BT_STATUS_CONNECTING				= เชื่อมต่อ ...
BT_STATUS_CONNECTED					= เกี่ยวข้อง
BT_STATUS_DISCONNECTING			= ยกเลิกการเชื่อมต่อ ...
BT_REMOTE_DEVICE_NAME       = ระยะไกลชื่ออุปกรณ์:
BT_DEVICE_CONNECTED         = อุปกรณ์ที่เชื่อมต่อ
BT_DEVICE_NAME              = อุปกรณ์:
BT_PIN_CODE                 = รหัสพิน:
BT_CALL_DECLINE							= ปฏิเสธ
BT_CALL_ANSWER							= คำตอบ
BT_CALL_END									= วาง
BT_CALL_STATUS_OUTGOING			= กำลังโทร
BT_CALL_STATUS_INCOMING			= ที่เข้ามา ...
BT_CALL_STATUS_TEMINATED		= โทรสิ้นสุดวันที่.
BT_CALL_STATUS_SPEAKING			= การพูด
BT_RECENTS_MISSED           = การโทรที่พลาดไป
BT_RECENTS_RECEIVED         = เบอร์ที่ได้โทรเข้า
BT_RECENTS_DIALED           = เบอร์ที่ได้โทรออก
BT_RECENTS_RECORD           = บันทึกเสียง
BT_RECENTS_MISSED_EMPTY     = Missed calls list is empty
BT_RECENTS_RECEIVED_EMPTY     = Received calls list is empty
BT_RECENTS_DIALED_EMPTY     = Dialed calls list is empty
BT_RECENTS_RECORD_EMPTY     = Recorder list is empty

; Volume
VOLUME_NAVIGATION_VOL       = Navi vol
VOLUME_BLUETOOTH_VOL        = Bluetooth vol 
VOLUME_MEDIA_VOL            = สื่อ vol

; DVD
DVD_DVD                     = DVD
DVD_VCD                     = VCD
DVD_CD                      = CD
DVD_CDG                     = CDG
DVD_LOADING                 = กำลังโหลด ...
DVD_EJECTING                = Ejecting...
DVD_DISK_ERROR              = ข้อผิดพลาดดิสก์
DVD_NOFILE                  = ไฟล์ประเภทนี้ไม่มี
DVD_TRACK                   = แทร็ก
DVD_AUDIO_LEFT              = ซ.
DVD_AUDIO_RIGHT             = ข.
DVD_AUDIO_STEREO            = สเตอริโอ
DVD_AUDIO_MIXED             = ผสม
DVD_PBC_ON                  = PBC ON
DVD_PBC_OFF                 = PBC OFF
DVD_AUDIO                   = เสียง
DVD_SUBTITLE                = หัวเรื่องย่อย
DVD_SUBTITLE_OFF            = คำบรรยายปิด
DVD_ANGLE                   = มุม
DVD_MENU                    = เมนู
DVD_TITLE                   = ชื่อเรื่อง

;ECAR
ECAR_TO_DIAL                = ในการโทรออก
ECAR_CANCEL                 = ยกเลิก
ECAR_CALL                   = หมุน
ECAR_CALL_ECAR              = โทร Ecar
ECAR_MSG_MULTI_RECORDS      = บันทึกหลาย
ECAR_MSG_NO_RECORDS         = ไม่มีบันทึก
ECAR_MSG_ONE_RECORDS        = หนึ่งระเบียน

;VDISK
VDISK_MSG_DISK_ERROR        = ข้อผิดพลาดดิสก์
VDISK_MSG_DISK_TO_RIP       = กรุณาเลือกแผ่นดิสก์ในการบันทึก
VDISK_MSG_DISK_TO_DELETE    = กรุณาเลือกแผ่นดิสก์ที่จะลบ
VDISK_MSG_START_RECORD      = เริ่มการบันทึก
VDISK_MSG_STOP_RECORD       = หยุดการบันทึก
VDISK_MSG_RECORD_FINISH     = บันทึกเสร็จ
VDISK_MSG_LOADING           = กำลังโหลด ...
VDISK_MSG_HAVE_RECORDED     = ได้รับการบันทึกลงในดิสก์
VDISK_MSG_NO_EMPTY_DISK     = ดิสก์ไม่มีการบันทึก
VDISK_MSG_NO_DISK_TO_DELETE = กำจัดดิสก์ไม่มี
VDISK_MSG_CREATE_FILE_FAIL  = สร้างไฟล์ล้มเหลว
VDISK_MSG_NO_ENOUGH_SPACE   = ไม่มีพื้นที่เพียงพอ

;AVIN
AUX_NO_SIGNAL               = ไม่มีสัญญาณ

;Calendar
CALENDAR_MON        = M
CALENDAR_TUE        = T
CALENDAR_WED        = W
CALENDAR_THU        = T
CALENDAR_FRI        = F
CALENDAR_SAT        = S
CALENDAR_SUN        = S

;play control
PLAY_PREV           = ก่อน
PLAY_NEXT           = ถัดไป
PLAY_PAUSE          = หยุด
PLAY_PLAY           = เล่น
PLAY_PLAYnPAUSE     = เล่น/หยุด
PLAY_FFWD           = ข้างหน้า
PLAY_REWIND         = ม้วนกลับ
PLAY_STOP           = Stop


;miscallaneous
MIS_CAMERA_NO_SIGNAL        = สัญญาณกล้องไม่มี
MIS_VIDEO_FORBIDDEN_TIP = การเตือน
MIS_VIDEO_FORBIDDEN   = มันเป็นสิ่งผิดกฎหมายเพื่อดูวิดีโอ \n ขณะขับรถหรือการดำเนินงานยานยนต์, \n การตั้งค่าที่จอดรถเบรกเพื่อดูวิดีโอ.
MIS_UNSUPPORTED_FILE  = ไม่สนับสนุนรูปแบบไฟล์
MIS_UNSUPPORTED_VIDEO = ไม่สนับสนุนรูปแบบวิดีโอ
MIS_UNSUPPORTED_AUDIO = ไม่สนับสนุนรูปแบบเสียง
MIS_BT_NOT_CONNECTED   = BT ไม่ได้เชื่อมต่อ
MIS_NAVI_LOAD_FAIL     = ไม่สามารถโหลดนำทาง
MIS_NAVI_PATH_NOT_SET  = เส้นทางการใช้งานการตั้งค่า
MIS_NAVI_CARD_NOT_EXIST     = บัตรนำทางไม่มี
MIS_NAVI_WARNING       = Caution!
MIS_NAVI_AGREE         = I agree
MIS_NAVI_WARNING_MSG1   = Drive safely and obey traffic rules, You must secure
MIS_NAVI_WARNING_MSG2   = the device so that it will not interfere with the
MIS_NAVI_WARNING_MSG3   = vehicle's operating controls or cause damage or
MIS_NAVI_WARNING_MSG4   = personal injury. You are solely responsible for the
MIS_NAVI_WARNING_MSG5   = safe operation of your vehicle and use of the device
MIS_NAVI_WARNING_MSG6   = in a manner that will not cause an accident, injury or
MIS_NAVI_WARNING_MSG7   = property damage. Do not operate this device while
MIS_NAVI_WARNING_MSG8  = driving. Park the vehicle first.
MIS_DISK_NOT_EXIST     = ไม่มีดิสก์
MIS_SD_NOT_EXIST       = ไม่มีการ์ด SD
MIS_USB_NOT_EXIST      = ไม่มี USB ดิสก์
MIS_IPOD_NOT_EXIST     = IPOD ไม่มี
MIS_PHONELINK_NOT_EXIST     = No Phone Connected
MIS_PHONELINK_INSTALL     	= Install Phonelink
MIS_PHONELINK_INSTALL_OK     = Install OK
MIS_PHONELINK_CONNECTING     = Connecting phone
MIS_LOUDNESS_ON          = Loud ON  
MIS_LOUDNESS_OFF         = Loud OFF
MIS_SUBWOOFER_ON         = Subwoofer ON
MIS_SUBWOOFER_OFF         = Subwoofer OFF
MIS_PLAY_RANDOM_ON         = Random ON
MIS_PLAY_RANDOM_OFF        = Random OFF
MIS_PLAY_REPEAT_ALL        = Repeat ALL
MIS_PLAY_REPEAT_SINGLE     = Repeat SINGLE
MIS_PLAY_REPEAT_FOLDER     = Repeat FOLDER
MIS_PLAY_REPEAT_OFF        = Repeat OFF
MIS_PLAY_REPEAT_TITLE      = Repeat Title
MIS_PLAY_REPEAT_CHAPTER    = Repeat Chapter

; GoBang
GOBANG_SCORE					     = คะแนน
GOBANG_LEVEL					     = ระดับความยาก
GOBANG_THINK					     = สะท้อนคอมพิวเตอร์ ...
GOBANG_PC_WIN				  	   = ขออภัยคุณสูญเสีย!
GOBANG_MAN_WIN				  	 = ยินดีด้วย คุณชนะแล้ว
GOBANG_BLACK_WIN					 = อาใหญ่ชนะสีดำ!
GOBANG_WHITE_WIN					 = อาใหญ่สีขาวชนะ!
GOBANG_BLACK_MOVE			     = ตอนนี้มันเป็นสีดำ!
GOBANG_WHITE_MOVE		       = สีขาวตอนนี้หันไป!
GOBANG_CHESS_BLACK         = BLACK:
GOBANG_CHESS_WHITE         = WHITE:
GOBANG_TIE				  	     = วาด!


; ********************************************
;  TimeZone
; ********************************************
tz_title       = Time Zone
tz_01 	= (GMT-12:00) International Date Line West
tz_02 	= (GMT-11:00) Midway Island, Samoa
tz_03 	= (GMT-10:00) Hawaii
tz_04 	= (GMT-09:00) Alaska
tz_05 	= (GMT-08:00) Pacific Time (US & Canada)
tz_06 	= (GMT-07:00) Mountain Time (US & Canada)
tz_07 	= (GMT-07:00) Chihuahua, La Paz, Mazatlan
tz_08 	= (GMT-07:00) Arizona
tz_09 	= (GMT-06:00) Central Time (US & Canada)
tz_10 	= (GMT-06:00) Saskatchewan
tz_11 	= (GMT-06:00) Guadalajara, Mexico City, Monterrey
tz_12 	= (GMT-06:00) Central America
tz_13 	= (GMT-05:00) Eastern Time (US & Canada)
tz_14 	= (GMT-05:00) Indiana (East)
tz_15 	= (GMT-05:00) Bogota, Lima, Quito
tz_16 	= (GMT-04:00) Atlantic Time (Canada)
tz_17 	= (GMT-04:00) Caracas, La Paz
tz_18 	= (GMT-04:00) Santiago
tz_19 	= (GMT-03:30) Newfoundland
tz_20 	= (GMT-03:00) Brasilia
tz_21 	= (GMT-03:00) Buenos Aires, Georgetown
tz_22 	= (GMT-03:00) Greenland
tz_23 	= (GMT-02:00) Mid-Atlantic
tz_24 	= (GMT-01:00) Azores
tz_25 	= (GMT-01:00) Cape Verde Is.
tz_26 	= (GMT) Greenwich Mean Time : Dublin, Edinburgh, Lisbon, London
tz_27 	= (GMT) Casablanca, Monrovia
tz_28 	= (GMT+01:00) Belgrade, Bratislava, Budapest, Ljubljana, Prague
tz_29 	= (GMT+01:00) Sarajevo, Skopje, Warsaw, Zagreb
tz_30 	= (GMT+01:00) Brussels, Copenhagen, Madrid, Paris
tz_31 	= (GMT+01:00) Amsterdam, Berlin, Bern, Rome, Stockholm, Vienna
tz_32 	= (GMT+01:00) West Central Africa
tz_33 	= (GMT+02:00) Bucharest
tz_34 	= (GMT+02:00) Cairo
tz_35 	= (GMT+02:00) Helsinki, Kyiv, Riga, Sofia, Tallinn, Vilnius
tz_36 	= (GMT+02:00) Athens, Istanbul, Minsk
tz_37 	= (GMT+02:00) Jerusalem
tz_38 	= (GMT+02:00) Harare, Pretoria
tz_39 	= (GMT+03:00) Moscow, St. Petersburg, Volgograd
tz_40 	= (GMT+03:00) Kuwait, Riyadh
tz_41 	= (GMT+03:00) Nairobi
tz_42 	= (GMT+03:00) Baghdad
tz_43 	= (GMT+03:30) Tehran
tz_44 	= (GMT+04:00) Abu Dhabi, Muscat
tz_45 	= (GMT+04:00) Baku, Tbilisi, Yerevan
tz_46 	= (GMT+04:30) Kabul
tz_47 	= (GMT+05:00) Ekaterinburg
tz_48 	= (GMT+05:00) Islamabad, Karachi, Tashkent
tz_49 	= (GMT+05:30) Chennai, Kolkata, Mumbai, New Delhi
tz_50 	= (GMT+05:45) Kathmandu
tz_51 	= (GMT+06:00) Astana, Dhaka
tz_52 	= (GMT+06:00) Sri Jayawardenepura
tz_53 	= (GMT+06:00) Almaty, Novosibirsk
tz_54 	= (GMT+06:30) Rangoon
tz_55 	= (GMT+07:00) Bangkok, Hanoi, Jakarta
tz_56 	= (GMT+07:00) Krasnoyarsk
tz_57 	= (GMT+08:00) Beijing, Chongqing, Hong Kong, Urumqi
tz_58 	= (GMT+08:00) Kuala Lumpur, Singapore
tz_59 	= (GMT+08:00) Taipei
tz_60 	= (GMT+08:00) Perth
tz_61 	= (GMT+08:00) Irkutsk, Ulaan Bataar
tz_62 	= (GMT+09:00) Seoul
tz_63 	= (GMT+09:00) Osaka, Sapporo, Tokyo
tz_64 	= (GMT+09:00) Yakutsk
tz_65 	= (GMT+09:30) Darwin
tz_66 	= (GMT+09:30) Adelaide
tz_67 	= (GMT+10:00) Canberra, Melbourne, Sydney
tz_68 	= (GMT+10:00) Brisbane
tz_69 	= (GMT+10:00) Hobart
tz_70 	= (GMT+10:00) Vladivostok 
tz_71 	= (GMT+10:00) Guam, Port Moresby
tz_72 	= (GMT+11:00) Magadan, Solomon Is., New Caledonia
tz_73 	= (GMT+12:00) Fiji, Kamchatka, Marshall Is.
tz_74 	= (GMT+12:00) Auckland, Wellington
tz_75 	= (GMT+13:00) Nuku'alofa
tz_76 	= (GMT-08:00) Tijuana, Baja California
tz_77   = (GMT-04:30) Caracas
